// =============================================================================
//
//	Библиотека классов для расчета плоской
//  стержневой системы методом конечных элементов.
//	Copyright (c) 2012 Субботин Даниил (subdan@me.com)
//
// =============================================================================
package ru.subdan.fem
{
	/**
	 * Класс описывает материал стержня.
	 */
	public class FemMaterial
	{
		/**
		 * Название материала стержня.
		 */
		public var name:String;

		/**
		 * Модуль упругости материала стержня, Па.
		 */
		public var E:Number;

		/**
		 * Площадь поперечного сечения стержня, м^2.
		 */
		public var F:Number;

		/**
		 * Момент инерции материала стрежня, м^4.
		 */
		public var I:Number;

		/**
		 * @constructor
		 * @param _name Название материала стержня.
		 * @param _E Модуль упругости материала стержня, Па.
		 * @param _F Площадь поперечного сечения стержня, м^2.
		 * @param _I Момент инерции материала стрежня, м^4.
		 */
		public function FemMaterial(_name:String, _E:Number, _F:Number,
		                            _I:Number)
		{
			name = _name;
			E = _E;
			F = _F;
			I = _I;
		}
	}
}
